app/serializers/person_serializer.rb

  def attributes(*args)
    data = super
    data[:id] = self.object.id
    data[:name] = self.object.name
    data[:gender] = self.object.gender
    self.object.articles.map do |article|
---
SELECT "articles"."id" FROM "articles" WHERE "articles"."person_id" = $1  [["person_id", 1]]