app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles"
---
      def index
        @articles = Article.all;

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        article = Article.find(params[:id])

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "third blog"], ["body", "this is my third blog"], ["created_at", "2019-10-18 07:02:46.739017"], ["updated_at", "2019-10-18 07:02:46.739017"]]
---
      def create
        article = Article.new(article_params)
        if(article.save)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]
---
      def destroy
        article = Article.find(params[:id])
        if (article.destroy)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "React.js is a library of javascript not a framework and used as a view in MVC architecture and its fast"], ["updated_at", "2019-10-18 07:31:43.264700"], ["id", 4]]
---
      def update
        article = Article.find(params[:id])
        if article.update(article_params)